"""

==	เช็คว่าค่าสองค่าเท่ากันหรือไม่	                    (a == b) เป็นเท็จ
!=	เช็คว่าค่าสองค่าไม่เท่ากันหรือไม่	                (a != b) เป็นจริง
<>	เช็คว่าค่าสองค่าไม่เท่ากันหรือไม่	                (a <> b) เป็นจริง. เหมือนกับตัวดำเนินการ !=
>	เช็คว่าค่าทางซ้ายมากกว่าค่าทางขวาหรือไม่	        (a > b) เป็นเท็จ
<	เช็คว่าค่าทางซ้ายน้อยกว่าค่าทางขวาหรือไม่	        (a < b) เป็นจริง
>=	เช็คว่าค่าทางซ้ายมากกว่าหรือเท่ากับค่าทางขวาหรือไม่	(a >= b) เป็นเท็จ
<=	เช็คว่าค่าทางซ้ายน้อยกว่าหรือเท่ากับค่าทางขวาหรือไม่	(a <= b) เป็นจริง.

and	and     เช็คว่าทั้งสองตัวเป็นจริงถึงจะคืนค่าจริง                กรณีอื่นๆเป็น เท็จทั้งหมด	(a and b) เป็นจริง.
or	or      ถ้าทั้งสองตัวหนึ่งเป็นเท็จจะคืนค่า เท็จ                 กรณีอื่นๆ เป็นจริงทังหมด	(a or b) เป็นจริง.
not	        คืนค่าตรงกันข้ามของค่าปัจจุบัน	not(a and b) เป็นเท็จ เพราะ a and b เป็นจริง.

in	        จะคืนค่าเป็นจริงถ้า พบค่าในตัวแปรที่เราสนใจ ในกรณีอื่นเป็นเท็จทั้งหมด
            x in y, คือค่าเป็น 1 ถ้า x เป็นสมาชิกของ y.

not in	    จะคืนค่าเป็นจริงถ้าไม่พบค่าในตัวแปรที่เราสนใจ ในกรณีอื่นเป็นเท็จทั้งหมด
            x not in y, คือค่าเป็น 1 ถ้า x ไม่เป็นสมาชิกของ y

Order

1)!  **	    Exponentiation
2)  ~x	    Bitwise not
3)  +x, -x	Positive, negative
4)!  *, /, //, %	Multiplication, division, remainder
5)!  +, -	Addition, subtraction
6)  <<, >>	Bitwise shifts
7)  &	    Bitwise AND
8)  ^	    Bitwise XOR
9)  |	    Bitwise OR

10) in, not in, is, is not, <, <=,  >,  >=, <>, !=, ==	    Comparisons, membership, identity

12) not x	Boolean NOT
13) and	    Boolean AND
14) or	    Boolean OR
15) lambda	Lambda expression



"""

simple = 10 + 5 ** 2 / 5  # ==> 10 + ((5 ** 2) / 5)
print(simple)

x = (3 ** 3) ** 2  # ==> 3 ** (3 ** 2)   3^3^2
print(x)

a = 10
b = 20

print(3 // 2)  # 0

print(a + b)
print(a - b)
print(a * b)
print(a / b)  # 0.5

print(b % a)  # 0
print(a % b)  # 10  ปริ้น เศษ   4 % 2 = 0     5 % 2 = 1
print(a ** b)  # power

print(3 // 2)  # 0

add = 2
c = 5
c += 7  # c = c + 7 # 12
print(c)

c += add
# c = c + add
print(c)
